espressif/arduino-esp32/libraries/WebServer/src/WebServer.cpp
    String _H1 = md5str(String(_username) + ':' + _realm + ':' + *password);
    // we're extra concerned; as digest request us to know the password
    // in the clear.
    memset((void *)password->c_str(), 0, password->length());
    delete password;
    _username = "";

    String _nonce = _extractParam(authReq, F("nonce=\""), '\"');
    String _response = _extractParam(authReq, F("response=\""), '\"');
    String _opaque = _extractParam(authReq, F("opaque=\""), '\"');

    if ((!_realm.length()) || (!_nonce.length()) || (!_uri.length()) || (!_response.length()) || (!_opaque.length())) {
      goto exf;
    }

    // parameters for the RFC 2617 newer Digest
    String _nc, _cnonce;
    if (authReq.indexOf(FPSTR(qop_auth)) != -1 || authReq.indexOf(FPSTR(qop_auth_quoted)) != -1) {
      _nc = _extractParam(authReq, F("nc="), ',');
      _cnonce = _extractParam(authReq, F("cnonce=\""), '\"');
    }

    log_v("Hash of user:realm:pass=%s", _H1.c_str());
    String _H2 = md5str(String(http_method_str(_currentMethod)) + ':' + _uri);
    log_v("Hash of method:uri=%s", _H2.c_str());
    String _responsecheck = "";
    if (authReq.indexOf(FPSTR(qop_auth)) != -1 || authReq.indexOf(FPSTR(qop_auth_quoted)) != -1) {
      _responsecheck = md5str(_H1 + ':' + _nonce + ':' + _nc + ':' + _cnonce + F(":auth:") + _H2);
    } else {
      _responsecheck = md5str(_H1 + ':' + _nonce + ':' + _H2);
    }
    authReq = "";

    log_v("The Proper response=%s", _responsecheck.c_str());
    if (!_response.equalsConstantTime(_responsecheck)) {
      log_v("Authentication Failed");
      return false;
    }

    // Credentials match the nonce the client sent. A signed nonce that is still
    // within TTL is accepted even if another client has since been challenged.
    // An expired or unknown nonce gets stale=true so the browser retries silently.
    if (_isDigestNonceValid(_nonce) && _opaque.equalsConstantTime(_sopaque) && _realm.equalsConstantTime(_srealm)) {
      log_v("Authentication Success");
      return true;
    }

    _digestNonceStale = true;
    log_v("Authentication Failed (stale nonce)");
    return false;
  } else if (authReq.length()) {
    // OTHER_AUTH
    log_v("Trying to authenticate using Other Auth, authReq=%s", authReq.c_str());
    String *ret = fn(OTHER_AUTH, authReq, {});
    if (ret) {
      log_v("Authentication Success");
      delete ret;
      return true;
    }
  }
exf:
  authReq = "";
  log_v("Authentication Failed");
  return false;
}

static const size_t DIGEST_NONCE_TS_LEN = 4;
static const size_t DIGEST_NONCE_RND_LEN = 4;
static const size_t DIGEST_NONCE_MAC_LEN = 16;
static const size_t DIGEST_NONCE_BIN_LEN = DIGEST_NONCE_TS_LEN + DIGEST_NONCE_RND_LEN + DIGEST_NONCE_MAC_LEN;
static const size_t DIGEST_NONCE_HEX_LEN = DIGEST_NONCE_BIN_LEN * 2;
static const char DIGEST_OPAQUE_LABEL[] = "WebServer-opaque";

static void digestPutBe32(uint8_t *out, uint32_t value) {
  out[0] = (uint8_t)(value >> 24);
  out[1] = (uint8_t)(value >> 16);
  out[2] = (uint8_t)(value >> 8);
  out[3] = (uint8_t)value;
}

static uint32_t digestGetBe32(const uint8_t *in) {
  return ((uint32_t)in[0] << 24) | ((uint32_t)in[1] << 16) | ((uint32_t)in[2] << 8) | (uint32_t)in[3];
}

void WebServer::_ensureDigestAuthMaterial() {
  if (_digestSecretReady) {
    return;
  }

  for (size_t i = 0; i < sizeof(_digestSecret); i += sizeof(uint32_t)) {
    uint32_t rnd = esp_random();
    size_t n = sizeof(_digestSecret) - i;
    if (n > sizeof(rnd)) {
      n = sizeof(rnd);
    }
    memcpy(_digestSecret + i, &rnd, n);
  }

  SHA256Builder sha256;
  HMACBuilder hmac(&sha256);
  hmac.setKey(_digestSecret, sizeof(_digestSecret));
  hmac.begin();
  hmac.add(DIGEST_OPAQUE_LABEL);
  hmac.calculate();
  uint8_t mac[SHA2_256_HASH_SIZE];
  hmac.getBytes(mac);
  _sopaque = HEXBuilder::bytes2hex(mac, DIGEST_NONCE_MAC_LEN);
  _digestSecretReady = true;
}

String WebServer::_makeDigestNonce() {
  _ensureDigestAuthMaterial();

  uint8_t msg[DIGEST_NONCE_TS_LEN + DIGEST_NONCE_RND_LEN];
  digestPutBe32(msg, millis());
  digestPutBe32(msg + DIGEST_NONCE_TS_LEN, esp_random());

  SHA256Builder sha256;
  HMACBuilder hmac(&sha256);
  hmac.setKey(_digestSecret, sizeof(_digestSecret));
  hmac.begin();
  hmac.add(msg, sizeof(msg));
  hmac.calculate();
  uint8_t mac[SHA2_256_HASH_SIZE];
  hmac.getBytes(mac);

  return HEXBuilder::bytes2hex(msg, sizeof(msg)) + HEXBuilder::bytes2hex(mac, DIGEST_NONCE_MAC_LEN);
}

bool WebServer::_isDigestNonceValid(const String &nonce) {
  _ensureDigestAuthMaterial();

  if (nonce.length() != DIGEST_NONCE_HEX_LEN || !HEXBuilder::isHexString(nonce)) {
    return false;
  }

  uint8_t raw[DIGEST_NONCE_BIN_LEN];
  if (HEXBuilder::hex2bytes(raw, sizeof(raw), nonce.c_str()) != sizeof(raw)) {
    return false;
  }

  SHA256Builder sha256;
  HMACBuilder hmac(&sha256);
  hmac.setKey(_digestSecret, sizeof(_digestSecret));
  hmac.begin();
  hmac.add(raw, DIGEST_NONCE_TS_LEN + DIGEST_NONCE_RND_LEN);
  hmac.calculate();
  uint8_t mac[SHA2_256_HASH_SIZE];
  hmac.getBytes(mac);

  uint8_t diff = 0;
  for (size_t i = 0; i < DIGEST_NONCE_MAC_LEN; i++) {
    diff |= mac[i] ^ raw[DIGEST_NONCE_TS_LEN + DIGEST_NONCE_RND_LEN + i];
  }
  if (diff != 0) {
    return false;
  }

#if WEBSERVER_DIGEST_NONCE_TTL > 0
  uint32_t issued = digestGetBe32(raw);
  if ((millis() - issued) > (uint32_t)WEBSERVER_DIGEST_NONCE_TTL) {
    return false;
  }
#endif
  return true;
}

void WebServer::requestAuthentication(HTTPAuthMethod mode, const char *realm, const String &authFailMsg) {
  if (realm == NULL) {
    _srealm = String(F("Login Required"));
  } else {
    _srealm = String(realm);
  }
  if (mode == BASIC_AUTH) {
    _digestNonceStale = false;
    sendHeader(String(FPSTR(WWW_Authenticate)), AuthTypeBasic + String(F(" realm=\"")) + _srealm + String(F("\"")));
  } else {
    String header = AuthTypeDigest + String(F(" realm=\"")) + _srealm + String(F("\", qop=\"auth\", nonce=\"")) + _makeDigestNonce()
                    + String(F("\", opaque=\"")) + _sopaque + String(F("\""));
    if (_digestNonceStale) {
      header += F(", stale=true");
      _digestNonceStale = false;
    }
    sendHeader(String(FPSTR(WWW_Authenticate)), header);
  }
  using namespace mime;
  send(401, String(FPSTR(mimeTable[html].mimeType)), authFailMsg);
}

RequestHandler &WebServer::on(const Uri &uri, WebServer::THandlerFunction handler) {
  return on(uri, HTTP_ANY, handler);
}

